Tekla Open API Reference for Tekla Structures 2025
RectangleBoundingBox.CreateRectangleBoundingBox Method
 Creates a new RectangleBoundingBox with the given values.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RectangleBoundingBox CreateRectangleBoundingBox(
	Point CenterPoint,
	double Width,
	double Height,
	double AngleToAxis
)
Public Shared Function CreateRectangleBoundingBox (
	CenterPoint As Point,
	Width As Double,
	Height As Double,
	AngleToAxis As Double
) As RectangleBoundingBox
Parameters
CenterPoint
Type: Tekla.Structures.Geometry3d.Point
The center point of the bounding box.
Width
Type: System.Double
The width of the bounding box.
Height
Type: System.Double
The height of the bounding box.
AngleToAxis
Type: System.Double
The angle of the box (compared to the X-axis).
Return Value
Type: RectangleBoundingBox
The created rectangle bounding box.
See Also
Reference
RectangleBoundingBox Class
Tekla.Structures.Drawing Namespace